[
  {
    "Make": "Winnebago",
    "Chassis": "Ford",
    "Year": 2015,
    "Model": "Minnie Winnie 22R",
    "Class": 3,
    "Sleeps": 6,
    "Length": 23,
    "Height": 13.2,
    "Image": "C:/Users/Guose/source/repos/GitHubRepos/ShowcaseRVHubApp/ShowcaseRVHub.MAUI/Resources/Images/minniewinnie.jpg",
    "Description": "Great for family vacations with all the extras included to make your trip enjoyable, feasible, and easy to use. Features include: RV has master bedroom with queen bed & wardrobe cabinet, queen bed over the cab, dinette converts to bed, full bathroom & shower, stove/oven combo, microwave, refrigerator/freezer, AC unit, electric awning, & plenty of storage. Clean bedding, pots, pans, plates, bowls, coffee maker, cups, & kitchen utensils included in rental. Other add-ons are available for rental: inflatable rafting tube, kayaks, paddle boards, sledding tubes, etc. 24/7 support with certified techs available to address the unexpected. We do offer delivery and pickup services and flexible with pickup & return times. Secure onsite parking of your vehicle is available on request. Towing of any trailer, boat, or vehicle is prohibited. Reservation dates confirmed once payment is made. If you have questions, please let us know.",
    "IsBooked": true,
    "HasSlideOut": false,
    "HasGenerator": true,
    "GeneratorHours": 24,
    "Odometer": 79362,
    "MasterBedType": 2
  },
  {
    "Make": "Thor Motor Coach",
    "Chassis": "Ford",
    "Year": 2017,
    "Model": "Thor Feedom Elite 23H",
    "Class": 3,
    "Sleeps": 6,
    "Length": 24,
    "Height": 13,
    "Image": "C:/Users/Guose/source/repos/GitHubRepos/ShowcaseRVHubApp/ShowcaseRVHub.MAUI/Resources/Images/thor.jpg",
    "Description": "Great for family vacations with all the extras included to make your trip enjoyable, feasible, and easy to use. SLEEPS 6. Features include: RV has master bedroom with queen bed & wardrobe cabinet, queen bed over the cab, dinette converts to bed, full bathroom & shower, stove/oven combo, microwave, large electric/LP refrigerator/freezer, AC unit, power awning with LED lighting, 32 swivel mount TV, DVD player, 4.0 micro quiet Onan generator, 30 amp shore power cord, auto transfer switch, 40 Gal fresh water tank, 38.5 Gal gray water tank, 24.5 Gal black water tank, 10 gal propane tank, & plenty of storage. Clean bedding, towels, pots, pans, plates, bowls, coffee maker, cups, & kitchen utensils included in rental. 24/7 support with certified techs available to address the unexpected. We do offer delivery and pickup services and flexible pickup & return times. SECURE ONSITE PARKING OF YOUR VEHICLE IS AVAILABLE. Towing of any trailer, boat, or vehicle is prohibited. If you have questions, please let us know. John",
    "IsBooked": true,
    "HasSlideOut": false,
    "HasGenerator": true,
    "GeneratorHours": 48,
    "Odometer": 35486,
    "MasterBedType": 2
  },
  {
    "Make": "Forest River",
    "Chassis": "Ford",
    "Year": 2019,
    "Model": "Sunseeker",
    "Class": 3,
    "Sleeps": 6,
    "Length": 27,
    "Height": 12.6,
    "Image": "C:/Users/Guose/source/repos/GitHubRepos/ShowcaseRVHubApp/ShowcaseRVHub.MAUI/Resources/Images/sunseeker.jpg",
    "Description": "Excellent for family vacations with all the extras included to make your trip enjoyable, feasible, and easy to use. Features include: RV has solar panels, thermal windows, and Artic Pack for winter travels, one slide out to increase living space, private master bedroom with memory foam queen bed & wardrobe area/cabinet, full queen bed above driver's seat, dinette converts to bed, full bathroom and shower, stove/oven combo, microwave, refrigerator/freezer, 2 AC units, motorized awning for easy access, and plenty of undercarriage storage area. Clean bedding, pots, pans, plates, bowls, coffee maker, cups, and kitchen utensils are included in rental. Other add-ons are available for rental: inflatable rafting tube, kayaks, paddle boards, sledding tubes, etc. 24/7 support with certified techs available to address the unexpected. We do offer delivery and pickup services and flexible with pickup & return times. Secure onsite parking of your vehicle is available on request. Towing of any trailer, boat, or vehicle is prohibited. Reservation dates confirmed once payment is made. If you have questions, please let us know.",
    "IsBooked": false,
    "HasSlideOut": true,
    "HasGenerator": true,
    "GeneratorHours": 60,
    "Odometer": 68912,
    "MasterBedType": 2
  }
]